Repository: ExLuzZziVo/CoreLib
Catalog: CoreLib.CORE/Resources/ValidationStrings.*.resx
Languages: ru

# ComplexObjectCollectionValidationError_ContainsNull
source: Can't be null
ru: Не может быть пустым

# ComplexObjectCollectionValidationError_Index
source: Element {0}:
ru: Элемент {0}:

# ComplexObjectCollectionValidationError
source: The sequence '{0}' contains elements with following errors
ru: Последовательность '{0}' содержит элементы со следующими ошибками

# CollectionMinLengthError
source: The sequence '{0}' must contain at least {1} elements
ru: Количество элементов в последовательности '{0}' должно быть не менее {1}

# CompareError
source: Fields '{0}' and '{1}' must match
ru: Поля '{0}' и '{1}' должны совпадать

# CompareToGreaterThanError
source: The value of the field '{0}' must be greater than the value of the field '{1}'
ru: Значение поля '{0}' должно быть больше значения поля '{1}'

# CompareToGreaterThanOrEqualError
source: The value of the field '{0}' must be greater than or equal to the value of the field '{1}'
ru: Значение поля '{0}' должно быть больше или равно значению поля '{1}'

# CompareToSmallerThanError
source: The value of the field '{0}' must be less than the value of the field '{1}'
ru: Значение поля '{0}' должно быть меньше значения поля '{1}'

# CompareToSmallerThanOrEqualError
source: The value of the field '{0}' must be less than or equal to the value of the field '{1}'
ru: Значение поля '{0}' должно быть меньше или равно значению поля '{1}'

# ComplexObjectValidationError
source: Field '{0}' has the following errors
ru: Поле '{0}' имеет следующие ошибки

# DateTimeError
source: Date in field '{0}' must be in the range {1} - {2}
ru: Дата в поле '{0}' должна лежать в диапазоне {1} - {2}

# DigitRangeValuesError
source: Field '{0}' must have a value of at least {1} and no more than {2}
ru: Поле '{0}' должно иметь значение не менее {1} и не более {2}

# DuplicateNameError
source: An object with the same name already exists
ru: Объект с таким названием уже существует

# FileNotFoundError
source: One or more files not found
ru: Один или несколько файлов не найдены

# FileParseByLineError
source: An error occurred while processing the file at line: {0}
ru: Во время обработки файла произошла ошибка в строке: {0}

# InvalidEmailAddressFormatError
source: Invalid e-mail address
ru: E-mail введен некорректно

# InvalidFilePathError
source: One or more files have an invalid save path
ru: Один или несколько файлов имеют некорректный путь сохранения

# InvalidPhoneFormatError
source: Invalid phone number
ru: Номер телефона введен некорректно

# NoIdError
source: Object ID not found
ru: Идентификатор объекта не найден

# NotFoundError
source: Object not found
ru: Объект не найден

# RequiredError
source: Field '{0}' is required
ru: Поле '{0}' должно быть заполнено

source: Something went wrong:(
ru: Что-то пошло не так:(

# StringFormatError
source: Field '{0}' has wrong format
ru: Поле '{0}' имеет неверный формат

# StringMaxLengthError
source: Field '{0}' must contain no more than {1} characters
ru: Поле '{0}' должно содержать не более {1} символов

# StringMinLengthError
source: Field '{0}' must contain at least {1} characters
ru: Поле '{0}' должно содержать не менее {1} символов

# StringRangeLengthError
source: Field '{0}' must contain at least {1} and no more than {2} characters
ru: Поле '{0}' должно содержать не менее {1} и не более {2} символов

# CollectionMaxLengthError
source: The sequence '{0}' must contain no more than {1}
ru: Количество элементов в последовательности '{0}' должно быть не более {1}

# CollectionRangeLengthError
source: The sequence '{0}' must contain at least {1} and no more than {2} elements
ru: Количество элементов в последовательности '{0}' должно быть не менее {1} и не более {2}

# CompareToNotEqualError
source: The value of the field '{0}' must not be equal to the value of the field '{1}'
ru: Значение поля '{0}' не должно быть равно значению поля '{1}'

# CompareToEqualError
source: The value of the field '{0}' must be equal to the value of the field '{1}'
ru: Значение поля '{0}' должно быть равно значению поля '{1}'

# ValueEqualError
source: The value of the field '{0}' must be equal to '{1}'
ru: Значение поля '{0}' должно быть равно '{1}'

# ValueGreaterThanError
source: The value of the field '{0}' must be greater than '{1}'
ru: Значение поля '{0}' должно быть больше '{1}'

# ValueGreaterThanOrEqualError
source: The value of the field '{0}' must be greater than or equal to '{1}'
ru: Значение поля '{0}' должно быть больше или равно '{1}'

# ValueNotEqualError
source: The value of the field '{0}' must not be equal to '{1}'
ru: Значение поля '{0}' не должно быть равно '{1}'

# ValueSmallerThanError
source: The value of the field '{0}' must be less than '{1}'
ru: Значение поля '{0}' должно быть меньше '{1}'

# ValueSmallerThanOrEqualError
source: The value of the field '{0}' must be less than or equal to '{1}'
ru: Значение поля '{0}' должно быть меньше или равно '{1}'
